Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/mcan.h
/* -------- MCAN_DBTP : (MCAN Offset: 0x0C) (R/W 32) Data Bit Timing and Prescaler Register -------- */
#define MCAN_DBTP_DSJW_Pos                    _UINT32_(0)                                          /* (MCAN_DBTP) Data (Re) Synchronization Jump Width Position */
#define MCAN_DBTP_DSJW_Msk                    (_UINT32_(0x7) << MCAN_DBTP_DSJW_Pos)                /* (MCAN_DBTP) Data (Re) Synchronization Jump Width Mask */
#define MCAN_DBTP_DSJW(value)                 (MCAN_DBTP_DSJW_Msk & (_UINT32_(value) << MCAN_DBTP_DSJW_Pos)) /* Assigment of value for DSJW in the MCAN_DBTP register */
#define MCAN_DBTP_DTSEG2_Pos                  _UINT32_(4)                                          /* (MCAN_DBTP) Data Time Segment After Sample Point Position */
#define MCAN_DBTP_DTSEG2_Msk                  (_UINT32_(0xF) << MCAN_DBTP_DTSEG2_Pos)              /* (MCAN_DBTP) Data Time Segment After Sample Point Mask */
#define MCAN_DBTP_DTSEG2(value)               (MCAN_DBTP_DTSEG2_Msk & (_UINT32_(value) << MCAN_DBTP_DTSEG2_Pos)) /* Assigment of value for DTSEG2 in the MCAN_DBTP register */
#define MCAN_DBTP_DTSEG1_Pos                  _UINT32_(8)                                          /* (MCAN_DBTP) Data Time Segment Before Sample Point Position */
#define MCAN_DBTP_DTSEG1_Msk                  (_UINT32_(0x1F) << MCAN_DBTP_DTSEG1_Pos)             /* (MCAN_DBTP) Data Time Segment Before Sample Point Mask */
#define MCAN_DBTP_DTSEG1(value)               (MCAN_DBTP_DTSEG1_Msk & (_UINT32_(value) << MCAN_DBTP_DTSEG1_Pos)) /* Assigment of value for DTSEG1 in the MCAN_DBTP register */
#define MCAN_DBTP_DBRP_Pos                    _UINT32_(16)                                         /* (MCAN_DBTP) Data Bit Rate Prescaler Position */
#define MCAN_DBTP_DBRP_Msk                    (_UINT32_(0x1F) << MCAN_DBTP_DBRP_Pos)               /* (MCAN_DBTP) Data Bit Rate Prescaler Mask */
#define MCAN_DBTP_DBRP(value)                 (MCAN_DBTP_DBRP_Msk & (_UINT32_(value) << MCAN_DBTP_DBRP_Pos)) /* Assigment of value for DBRP in the MCAN_DBTP register */
#define MCAN_DBTP_TDC_Pos                     _UINT32_(23)                                         /* (MCAN_DBTP) Transmitter Delay Compensation Position */
#define MCAN_DBTP_TDC_Msk                     (_UINT32_(0x1) << MCAN_DBTP_TDC_Pos)                 /* (MCAN_DBTP) Transmitter Delay Compensation Mask */
#define MCAN_DBTP_TDC(value)                  (MCAN_DBTP_TDC_Msk & (_UINT32_(value) << MCAN_DBTP_TDC_Pos)) /* Assigment of value for TDC in the MCAN_DBTP register */
#define   MCAN_DBTP_TDC_DISABLED_Val          _UINT32_(0x0)                                        /* (MCAN_DBTP) Transmitter Delay Compensation disabled.  */
#define   MCAN_DBTP_TDC_ENABLED_Val           _UINT32_(0x1)                                        /* (MCAN_DBTP) Transmitter Delay Compensation enabled.  */
#define MCAN_DBTP_TDC_DISABLED                (MCAN_DBTP_TDC_DISABLED_Val << MCAN_DBTP_TDC_Pos)    /* (MCAN_DBTP) Transmitter Delay Compensation disabled. Position  */
#define MCAN_DBTP_TDC_ENABLED                 (MCAN_DBTP_TDC_ENABLED_Val << MCAN_DBTP_TDC_Pos)     /* (MCAN_DBTP) Transmitter Delay Compensation enabled. Position  */
#define MCAN_DBTP_Msk                         _UINT32_(0x009F1FF7)                                 /* (MCAN_DBTP) Register Mask  */


/* -------- MCAN_TEST : (MCAN Offset: 0x10) (R/W 32) Test Register -------- */
#define MCAN_TEST_LBCK_Pos                    _UINT32_(4)                                          /* (MCAN_TEST) Loop Back Mode (read/write) Position */
#define MCAN_TEST_LBCK_Msk                    (_UINT32_(0x1) << MCAN_TEST_LBCK_Pos)                /* (MCAN_TEST) Loop Back Mode (read/write) Mask */
#define MCAN_TEST_LBCK(value)                 (MCAN_TEST_LBCK_Msk & (_UINT32_(value) << MCAN_TEST_LBCK_Pos)) /* Assigment of value for LBCK in the MCAN_TEST register */
#define   MCAN_TEST_LBCK_DISABLED_Val         _UINT32_(0x0)                                        /* (MCAN_TEST) Reset value. Loop Back mode is disabled.  */
#define   MCAN_TEST_LBCK_ENABLED_Val          _UINT32_(0x1)                                        /* (MCAN_TEST) Loop Back mode is enabled (see Section 1.5.1.9).  */
#define MCAN_TEST_LBCK_DISABLED               (MCAN_TEST_LBCK_DISABLED_Val << MCAN_TEST_LBCK_Pos)  /* (MCAN_TEST) Reset value. Loop Back mode is disabled. Position  */
#define MCAN_TEST_LBCK_ENABLED                (MCAN_TEST_LBCK_ENABLED_Val << MCAN_TEST_LBCK_Pos)   /* (MCAN_TEST) Loop Back mode is enabled (see Section 1.5.1.9). Position  */
#define MCAN_TEST_TX_Pos                      _UINT32_(5)                                          /* (MCAN_TEST) Control of Transmit Pin (read/write) Position */
#define MCAN_TEST_TX_Msk                      (_UINT32_(0x3) << MCAN_TEST_TX_Pos)                  /* (MCAN_TEST) Control of Transmit Pin (read/write) Mask */
#define MCAN_TEST_TX(value)                   (MCAN_TEST_TX_Msk & (_UINT32_(value) << MCAN_TEST_TX_Pos)) /* Assigment of value for TX in the MCAN_TEST register */
#define   MCAN_TEST_TX_RESET_Val              _UINT32_(0x0)                                        /* (MCAN_TEST) Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time.  */
#define   MCAN_TEST_TX_SAMPLE_POINT_MONITORING_Val _UINT32_(0x1)                                        /* (MCAN_TEST) Sample Point can be monitored at pin CANTX.  */
#define   MCAN_TEST_TX_DOMINANT_Val           _UINT32_(0x2)                                        /* (MCAN_TEST) Dominant ('0') level at pin CANTX.  */
#define   MCAN_TEST_TX_RECESSIVE_Val          _UINT32_(0x3)                                        /* (MCAN_TEST) Recessive ('1') at pin CANTX.  */
#define MCAN_TEST_TX_RESET                    (MCAN_TEST_TX_RESET_Val << MCAN_TEST_TX_Pos)         /* (MCAN_TEST) Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time. Position  */
#define MCAN_TEST_TX_SAMPLE_POINT_MONITORING  (MCAN_TEST_TX_SAMPLE_POINT_MONITORING_Val << MCAN_TEST_TX_Pos) /* (MCAN_TEST) Sample Point can be monitored at pin CANTX. Position  */
#define MCAN_TEST_TX_DOMINANT                 (MCAN_TEST_TX_DOMINANT_Val << MCAN_TEST_TX_Pos)      /* (MCAN_TEST) Dominant ('0') level at pin CANTX. Position  */
#define MCAN_TEST_TX_RECESSIVE                (MCAN_TEST_TX_RECESSIVE_Val << MCAN_TEST_TX_Pos)     /* (MCAN_TEST) Recessive ('1') at pin CANTX. Position  */
#define MCAN_TEST_RX_Pos                      _UINT32_(7)                                          /* (MCAN_TEST) Receive Pin (read-only) Position */
#define MCAN_TEST_RX_Msk                      (_UINT32_(0x1) << MCAN_TEST_RX_Pos)                  /* (MCAN_TEST) Receive Pin (read-only) Mask */
#define MCAN_TEST_RX(value)                   (MCAN_TEST_RX_Msk & (_UINT32_(value) << MCAN_TEST_RX_Pos)) /* Assigment of value for RX in the MCAN_TEST register */
#define MCAN_TEST_Msk                         _UINT32_(0x000000F0)                                 /* (MCAN_TEST) Register Mask  */


/* -------- MCAN_RWD : (MCAN Offset: 0x14) (R/W 32) RAM Watchdog Register -------- */
#define MCAN_RWD_WDC_Pos                      _UINT32_(0)                                          /* (MCAN_RWD) Watchdog Configuration (read/write) Position */
#define MCAN_RWD_WDC_Msk                      (_UINT32_(0xFF) << MCAN_RWD_WDC_Pos)                 /* (MCAN_RWD) Watchdog Configuration (read/write) Mask */
#define MCAN_RWD_WDC(value)                   (MCAN_RWD_WDC_Msk & (_UINT32_(value) << MCAN_RWD_WDC_Pos)) /* Assigment of value for WDC in the MCAN_RWD register */
#define MCAN_RWD_WDV_Pos                      _UINT32_(8)                                          /* (MCAN_RWD) Watchdog Value (read-only) Position */
#define MCAN_RWD_WDV_Msk                      (_UINT32_(0xFF) << MCAN_RWD_WDV_Pos)                 /* (MCAN_RWD) Watchdog Value (read-only) Mask */
#define MCAN_RWD_WDV(value)                   (MCAN_RWD_WDV_Msk & (_UINT32_(value) << MCAN_RWD_WDV_Pos)) /* Assigment of value for WDV in the MCAN_RWD register */
#define MCAN_RWD_Msk                          _UINT32_(0x0000FFFF)                                 /* (MCAN_RWD) Register Mask  */


/* -------- MCAN_CCCR : (MCAN Offset: 0x18) (R/W 32) CC Control Register -------- */
#define MCAN_CCCR_INIT_Pos                    _UINT32_(0)                                          /* (MCAN_CCCR) Initialization (read/write) Position */
#define MCAN_CCCR_INIT_Msk                    (_UINT32_(0x1) << MCAN_CCCR_INIT_Pos)                /* (MCAN_CCCR) Initialization (read/write) Mask */
#define MCAN_CCCR_INIT(value)                 (MCAN_CCCR_INIT_Msk & (_UINT32_(value) << MCAN_CCCR_INIT_Pos)) /* Assigment of value for INIT in the MCAN_CCCR register */
#define   MCAN_CCCR_INIT_DISABLED_Val         _UINT32_(0x0)                                        /* (MCAN_CCCR) Normal operation.  */
#define   MCAN_CCCR_INIT_ENABLED_Val          _UINT32_(0x1)                                        /* (MCAN_CCCR) Initialization is started.  */
#define MCAN_CCCR_INIT_DISABLED               (MCAN_CCCR_INIT_DISABLED_Val << MCAN_CCCR_INIT_Pos)  /* (MCAN_CCCR) Normal operation. Position  */
#define MCAN_CCCR_INIT_ENABLED                (MCAN_CCCR_INIT_ENABLED_Val << MCAN_CCCR_INIT_Pos)   /* (MCAN_CCCR) Initialization is started. Position  */
#define MCAN_CCCR_CCE_Pos                     _UINT32_(1)                                          /* (MCAN_CCCR) Configuration Change Enable (read/write, write protection) Position */
#define MCAN_CCCR_CCE_Msk                     (_UINT32_(0x1) << MCAN_CCCR_CCE_Pos)                 /* (MCAN_CCCR) Configuration Change Enable (read/write, write protection) Mask */
#define MCAN_CCCR_CCE(value)                  (MCAN_CCCR_CCE_Msk & (_UINT32_(value) << MCAN_CCCR_CCE_Pos)) /* Assigment of value for CCE in the MCAN_CCCR register */
#define   MCAN_CCCR_CCE_PROTECTED_Val         _UINT32_(0x0)                                        /* (MCAN_CCCR) The processor has no write access to the protected configuration registers.  */
#define   MCAN_CCCR_CCE_CONFIGURABLE_Val      _UINT32_(0x1)                                        /* (MCAN_CCCR) The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1').  */
#define MCAN_CCCR_CCE_PROTECTED               (MCAN_CCCR_CCE_PROTECTED_Val << MCAN_CCCR_CCE_Pos)   /* (MCAN_CCCR) The processor has no write access to the protected configuration registers. Position  */
#define MCAN_CCCR_CCE_CONFIGURABLE            (MCAN_CCCR_CCE_CONFIGURABLE_Val << MCAN_CCCR_CCE_Pos) /* (MCAN_CCCR) The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1'). Position  */
#define MCAN_CCCR_ASM_Pos                     _UINT32_(2)                                          /* (MCAN_CCCR) Restricted Operation Mode (read/write, write protection against '1') Position */
#define MCAN_CCCR_ASM_Msk                     (_UINT32_(0x1) << MCAN_CCCR_ASM_Pos)                 /* (MCAN_CCCR) Restricted Operation Mode (read/write, write protection against '1') Mask */
#define MCAN_CCCR_ASM(value)                  (MCAN_CCCR_ASM_Msk & (_UINT32_(value) << MCAN_CCCR_ASM_Pos)) /* Assigment of value for ASM in the MCAN_CCCR register */
#define   MCAN_CCCR_ASM_NORMAL_Val            _UINT32_(0x0)                                        /* (MCAN_CCCR) Normal CAN operation.  */
#define   MCAN_CCCR_ASM_RESTRICTED_Val        _UINT32_(0x1)                                        /* (MCAN_CCCR) Restricted Operation mode active.  */
#define MCAN_CCCR_ASM_NORMAL                  (MCAN_CCCR_ASM_NORMAL_Val << MCAN_CCCR_ASM_Pos)      /* (MCAN_CCCR) Normal CAN operation. Position  */
#define MCAN_CCCR_ASM_RESTRICTED              (MCAN_CCCR_ASM_RESTRICTED_Val << MCAN_CCCR_ASM_Pos)  /* (MCAN_CCCR) Restricted Operation mode active. Position  */
#define MCAN_CCCR_CSA_Pos                     _UINT32_(3)                                          /* (MCAN_CCCR) Clock Stop Acknowledge (read-only) Position */
#define MCAN_CCCR_CSA_Msk                     (_UINT32_(0x1) << MCAN_CCCR_CSA_Pos)                 /* (MCAN_CCCR) Clock Stop Acknowledge (read-only) Mask */
#define MCAN_CCCR_CSA(value)                  (MCAN_CCCR_CSA_Msk & (_UINT32_(value) << MCAN_CCCR_CSA_Pos)) /* Assigment of value for CSA in the MCAN_CCCR register */
#define MCAN_CCCR_CSR_Pos                     _UINT32_(4)                                          /* (MCAN_CCCR) Clock Stop Request (read/write) Position */
#define MCAN_CCCR_CSR_Msk                     (_UINT32_(0x1) << MCAN_CCCR_CSR_Pos)                 /* (MCAN_CCCR) Clock Stop Request (read/write) Mask */
#define MCAN_CCCR_CSR(value)                  (MCAN_CCCR_CSR_Msk & (_UINT32_(value) << MCAN_CCCR_CSR_Pos)) /* Assigment of value for CSR in the MCAN_CCCR register */
#define   MCAN_CCCR_CSR_NO_CLOCK_STOP_Val     _UINT32_(0x0)                                        /* (MCAN_CCCR) No clock stop is requested.  */
#define   MCAN_CCCR_CSR_CLOCK_STOP_Val        _UINT32_(0x1)                                        /* (MCAN_CCCR) Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pending transfer requests have been completed and the CAN bus reached idle.  */
#define MCAN_CCCR_CSR_NO_CLOCK_STOP           (MCAN_CCCR_CSR_NO_CLOCK_STOP_Val << MCAN_CCCR_CSR_Pos) /* (MCAN_CCCR) No clock stop is requested. Position  */
#define MCAN_CCCR_CSR_CLOCK_STOP              (MCAN_CCCR_CSR_CLOCK_STOP_Val << MCAN_CCCR_CSR_Pos)  /* (MCAN_CCCR) Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pending transfer requests have been completed and the CAN bus reached idle. Position  */
#define MCAN_CCCR_MON_Pos                     _UINT32_(5)                                          /* (MCAN_CCCR) Bus Monitoring Mode (read/write, write protection against '1') Position */
#define MCAN_CCCR_MON_Msk                     (_UINT32_(0x1) << MCAN_CCCR_MON_Pos)                 /* (MCAN_CCCR) Bus Monitoring Mode (read/write, write protection against '1') Mask */
#define MCAN_CCCR_MON(value)                  (MCAN_CCCR_MON_Msk & (_UINT32_(value) << MCAN_CCCR_MON_Pos)) /* Assigment of value for MON in the MCAN_CCCR register */
#define   MCAN_CCCR_MON_DISABLED_Val          _UINT32_(0x0)                                        /* (MCAN_CCCR) Bus Monitoring mode is disabled.  */
#define   MCAN_CCCR_MON_ENABLED_Val           _UINT32_(0x1)                                        /* (MCAN_CCCR) Bus Monitoring mode is enabled.  */
#define MCAN_CCCR_MON_DISABLED                (MCAN_CCCR_MON_DISABLED_Val << MCAN_CCCR_MON_Pos)    /* (MCAN_CCCR) Bus Monitoring mode is disabled. Position  */
#define MCAN_CCCR_MON_ENABLED                 (MCAN_CCCR_MON_ENABLED_Val << MCAN_CCCR_MON_Pos)     /* (MCAN_CCCR) Bus Monitoring mode is enabled. Position  */
#define MCAN_CCCR_DAR_Pos                     _UINT32_(6)                                          /* (MCAN_CCCR) Disable Automatic Retransmission (read/write, write protection) Position */
#define MCAN_CCCR_DAR_Msk                     (_UINT32_(0x1) << MCAN_CCCR_DAR_Pos)                 /* (MCAN_CCCR) Disable Automatic Retransmission (read/write, write protection) Mask */
#define MCAN_CCCR_DAR(value)                  (MCAN_CCCR_DAR_Msk & (_UINT32_(value) << MCAN_CCCR_DAR_Pos)) /* Assigment of value for DAR in the MCAN_CCCR register */
#define   MCAN_CCCR_DAR_AUTO_RETX_Val         _UINT32_(0x0)                                        /* (MCAN_CCCR) Automatic retransmission of messages not transmitted successfully enabled.  */
#define   MCAN_CCCR_DAR_NO_AUTO_RETX_Val      _UINT32_(0x1)                                        /* (MCAN_CCCR) Automatic retransmission disabled.  */
#define MCAN_CCCR_DAR_AUTO_RETX               (MCAN_CCCR_DAR_AUTO_RETX_Val << MCAN_CCCR_DAR_Pos)   /* (MCAN_CCCR) Automatic retransmission of messages not transmitted successfully enabled. Position  */
#define MCAN_CCCR_DAR_NO_AUTO_RETX            (MCAN_CCCR_DAR_NO_AUTO_RETX_Val << MCAN_CCCR_DAR_Pos) /* (MCAN_CCCR) Automatic retransmission disabled. Position  */
#define MCAN_CCCR_TEST_Pos                    _UINT32_(7)                                          /* (MCAN_CCCR) Test Mode Enable (read/write, write protection against '1') Position */
#define MCAN_CCCR_TEST_Msk                    (_UINT32_(0x1) << MCAN_CCCR_TEST_Pos)                /* (MCAN_CCCR) Test Mode Enable (read/write, write protection against '1') Mask */
#define MCAN_CCCR_TEST(value)                 (MCAN_CCCR_TEST_Msk & (_UINT32_(value) << MCAN_CCCR_TEST_Pos)) /* Assigment of value for TEST in the MCAN_CCCR register */
#define   MCAN_CCCR_TEST_DISABLED_Val         _UINT32_(0x0)                                        /* (MCAN_CCCR) Normal operation, MCAN_TEST register holds reset values.  */
#define   MCAN_CCCR_TEST_ENABLED_Val          _UINT32_(0x1)                                        /* (MCAN_CCCR) Test mode, write access to MCAN_TEST register enabled.  */
#define MCAN_CCCR_TEST_DISABLED               (MCAN_CCCR_TEST_DISABLED_Val << MCAN_CCCR_TEST_Pos)  /* (MCAN_CCCR) Normal operation, MCAN_TEST register holds reset values. Position  */
#define MCAN_CCCR_TEST_ENABLED                (MCAN_CCCR_TEST_ENABLED_Val << MCAN_CCCR_TEST_Pos)   /* (MCAN_CCCR) Test mode, write access to MCAN_TEST register enabled. Position  */
#define MCAN_CCCR_FDOE_Pos                    _UINT32_(8)                                          /* (MCAN_CCCR) CAN FD Operation Enable (read/write, write protection) Position */
#define MCAN_CCCR_FDOE_Msk                    (_UINT32_(0x1) << MCAN_CCCR_FDOE_Pos)                /* (MCAN_CCCR) CAN FD Operation Enable (read/write, write protection) Mask */
#define MCAN_CCCR_FDOE(value)                 (MCAN_CCCR_FDOE_Msk & (_UINT32_(value) << MCAN_CCCR_FDOE_Pos)) /* Assigment of value for FDOE in the MCAN_CCCR register */
#define   MCAN_CCCR_FDOE_DISABLED_Val         _UINT32_(0x0)                                        /* (MCAN_CCCR) FD operation disabled.  */
#define   MCAN_CCCR_FDOE_ENABLED_Val          _UINT32_(0x1)                                        /* (MCAN_CCCR) FD operation enabled.  */
#define MCAN_CCCR_FDOE_DISABLED               (MCAN_CCCR_FDOE_DISABLED_Val << MCAN_CCCR_FDOE_Pos)  /* (MCAN_CCCR) FD operation disabled. Position  */
#define MCAN_CCCR_FDOE_ENABLED                (MCAN_CCCR_FDOE_ENABLED_Val << MCAN_CCCR_FDOE_Pos)   /* (MCAN_CCCR) FD operation enabled. Position  */
#define MCAN_CCCR_BRSE_Pos                    _UINT32_(9)                                          /* (MCAN_CCCR) Bit Rate Switching Enable (read/write, write protection) Position */
#define MCAN_CCCR_BRSE_Msk                    (_UINT32_(0x1) << MCAN_CCCR_BRSE_Pos)                /* (MCAN_CCCR) Bit Rate Switching Enable (read/write, write protection) Mask */
#define MCAN_CCCR_BRSE(value)                 (MCAN_CCCR_BRSE_Msk & (_UINT32_(value) << MCAN_CCCR_BRSE_Pos)) /* Assigment of value for BRSE in the MCAN_CCCR register */
#define   MCAN_CCCR_BRSE_DISABLED_Val         _UINT32_(0x0)                                        /* (MCAN_CCCR) Bit rate switching for transmissions disabled.  */
#define   MCAN_CCCR_BRSE_ENABLED_Val          _UINT32_(0x1)                                        /* (MCAN_CCCR) Bit rate switching for transmissions enabled.  */
#define MCAN_CCCR_BRSE_DISABLED               (MCAN_CCCR_BRSE_DISABLED_Val << MCAN_CCCR_BRSE_Pos)  /* (MCAN_CCCR) Bit rate switching for transmissions disabled. Position  */
#define MCAN_CCCR_BRSE_ENABLED                (MCAN_CCCR_BRSE_ENABLED_Val << MCAN_CCCR_BRSE_Pos)   /* (MCAN_CCCR) Bit rate switching for transmissions enabled. Position  */
#define MCAN_CCCR_PXHD_Pos                    _UINT32_(12)                                         /* (MCAN_CCCR) Protocol Exception Event Handling (read/write, write protection) Position */
#define MCAN_CCCR_PXHD_Msk                    (_UINT32_(0x1) << MCAN_CCCR_PXHD_Pos)                /* (MCAN_CCCR) Protocol Exception Event Handling (read/write, write protection) Mask */
#define MCAN_CCCR_PXHD(value)                 (MCAN_CCCR_PXHD_Msk & (_UINT32_(value) << MCAN_CCCR_PXHD_Pos)) /* Assigment of value for PXHD in the MCAN_CCCR register */
#define MCAN_CCCR_EFBI_Pos                    _UINT32_(13)                                         /* (MCAN_CCCR) Edge Filtering during Bus Integration (read/write, write protection) Position */
#define MCAN_CCCR_EFBI_Msk                    (_UINT32_(0x1) << MCAN_CCCR_EFBI_Pos)                /* (MCAN_CCCR) Edge Filtering during Bus Integration (read/write, write protection) Mask */
#define MCAN_CCCR_EFBI(value)                 (MCAN_CCCR_EFBI_Msk & (_UINT32_(value) << MCAN_CCCR_EFBI_Pos)) /* Assigment of value for EFBI in the MCAN_CCCR register */
#define MCAN_CCCR_TXP_Pos                     _UINT32_(14)                                         /* (MCAN_CCCR) Transmit Pause (read/write, write protection) Position */
#define MCAN_CCCR_TXP_Msk                     (_UINT32_(0x1) << MCAN_CCCR_TXP_Pos)                 /* (MCAN_CCCR) Transmit Pause (read/write, write protection) Mask */
#define MCAN_CCCR_TXP(value)                  (MCAN_CCCR_TXP_Msk & (_UINT32_(value) << MCAN_CCCR_TXP_Pos)) /* Assigment of value for TXP in the MCAN_CCCR register */
#define MCAN_CCCR_NISO_Pos                    _UINT32_(15)                                         /* (MCAN_CCCR) Non-ISO Operation Position */
#define MCAN_CCCR_NISO_Msk                    (_UINT32_(0x1) << MCAN_CCCR_NISO_Pos)                /* (MCAN_CCCR) Non-ISO Operation Mask */
#define MCAN_CCCR_NISO(value)                 (MCAN_CCCR_NISO_Msk & (_UINT32_(value) << MCAN_CCCR_NISO_Pos)) /* Assigment of value for NISO in the MCAN_CCCR register */
#define MCAN_CCCR_Msk                         _UINT32_(0x0000F3FF)                                 /* (MCAN_CCCR) Register Mask  */


