Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/mcan.h
/* -------- MCAN_NBTP : (MCAN Offset: 0x1C) (R/W 32) Nominal Bit Timing and Prescaler Register -------- */
#define MCAN_NBTP_NTSEG2_Pos                  _UINT32_(0)                                          /* (MCAN_NBTP) Nominal Time Segment After Sample Point Position */
#define MCAN_NBTP_NTSEG2_Msk                  (_UINT32_(0x7F) << MCAN_NBTP_NTSEG2_Pos)             /* (MCAN_NBTP) Nominal Time Segment After Sample Point Mask */
#define MCAN_NBTP_NTSEG2(value)               (MCAN_NBTP_NTSEG2_Msk & (_UINT32_(value) << MCAN_NBTP_NTSEG2_Pos)) /* Assigment of value for NTSEG2 in the MCAN_NBTP register */
#define MCAN_NBTP_NTSEG1_Pos                  _UINT32_(8)                                          /* (MCAN_NBTP) Nominal Time Segment Before Sample Point Position */
#define MCAN_NBTP_NTSEG1_Msk                  (_UINT32_(0xFF) << MCAN_NBTP_NTSEG1_Pos)             /* (MCAN_NBTP) Nominal Time Segment Before Sample Point Mask */
#define MCAN_NBTP_NTSEG1(value)               (MCAN_NBTP_NTSEG1_Msk & (_UINT32_(value) << MCAN_NBTP_NTSEG1_Pos)) /* Assigment of value for NTSEG1 in the MCAN_NBTP register */
#define MCAN_NBTP_NBRP_Pos                    _UINT32_(16)                                         /* (MCAN_NBTP) Nominal Bit Rate Prescaler Position */
#define MCAN_NBTP_NBRP_Msk                    (_UINT32_(0x1FF) << MCAN_NBTP_NBRP_Pos)              /* (MCAN_NBTP) Nominal Bit Rate Prescaler Mask */
#define MCAN_NBTP_NBRP(value)                 (MCAN_NBTP_NBRP_Msk & (_UINT32_(value) << MCAN_NBTP_NBRP_Pos)) /* Assigment of value for NBRP in the MCAN_NBTP register */
#define MCAN_NBTP_NSJW_Pos                    _UINT32_(25)                                         /* (MCAN_NBTP) Nominal (Re) Synchronization Jump Width Position */
#define MCAN_NBTP_NSJW_Msk                    (_UINT32_(0x7F) << MCAN_NBTP_NSJW_Pos)               /* (MCAN_NBTP) Nominal (Re) Synchronization Jump Width Mask */
#define MCAN_NBTP_NSJW(value)                 (MCAN_NBTP_NSJW_Msk & (_UINT32_(value) << MCAN_NBTP_NSJW_Pos)) /* Assigment of value for NSJW in the MCAN_NBTP register */
#define MCAN_NBTP_Msk                         _UINT32_(0xFFFFFF7F)                                 /* (MCAN_NBTP) Register Mask  */


/* -------- MCAN_TSCC : (MCAN Offset: 0x20) (R/W 32) Timestamp Counter Configuration Register -------- */
#define MCAN_TSCC_TSS_Pos                     _UINT32_(0)                                          /* (MCAN_TSCC) Timestamp Select Position */
#define MCAN_TSCC_TSS_Msk                     (_UINT32_(0x3) << MCAN_TSCC_TSS_Pos)                 /* (MCAN_TSCC) Timestamp Select Mask */
#define MCAN_TSCC_TSS(value)                  (MCAN_TSCC_TSS_Msk & (_UINT32_(value) << MCAN_TSCC_TSS_Pos)) /* Assigment of value for TSS in the MCAN_TSCC register */
#define   MCAN_TSCC_TSS_ALWAYS_0_Val          _UINT32_(0x0)                                        /* (MCAN_TSCC) Timestamp counter value always 0x0000  */
#define   MCAN_TSCC_TSS_TCP_INC_Val           _UINT32_(0x1)                                        /* (MCAN_TSCC) Timestamp counter value incremented according to TCP  */
#define   MCAN_TSCC_TSS_EXT_TIMESTAMP_Val     _UINT32_(0x2)                                        /* (MCAN_TSCC) External timestamp counter value used  */
#define MCAN_TSCC_TSS_ALWAYS_0                (MCAN_TSCC_TSS_ALWAYS_0_Val << MCAN_TSCC_TSS_Pos)    /* (MCAN_TSCC) Timestamp counter value always 0x0000 Position  */
#define MCAN_TSCC_TSS_TCP_INC                 (MCAN_TSCC_TSS_TCP_INC_Val << MCAN_TSCC_TSS_Pos)     /* (MCAN_TSCC) Timestamp counter value incremented according to TCP Position  */
#define MCAN_TSCC_TSS_EXT_TIMESTAMP           (MCAN_TSCC_TSS_EXT_TIMESTAMP_Val << MCAN_TSCC_TSS_Pos) /* (MCAN_TSCC) External timestamp counter value used Position  */
#define MCAN_TSCC_TCP_Pos                     _UINT32_(16)                                         /* (MCAN_TSCC) Timestamp Counter Prescaler Position */
#define MCAN_TSCC_TCP_Msk                     (_UINT32_(0xF) << MCAN_TSCC_TCP_Pos)                 /* (MCAN_TSCC) Timestamp Counter Prescaler Mask */
#define MCAN_TSCC_TCP(value)                  (MCAN_TSCC_TCP_Msk & (_UINT32_(value) << MCAN_TSCC_TCP_Pos)) /* Assigment of value for TCP in the MCAN_TSCC register */
#define MCAN_TSCC_Msk                         _UINT32_(0x000F0003)                                 /* (MCAN_TSCC) Register Mask  */


/* -------- MCAN_TSCV : (MCAN Offset: 0x24) (R/W 32) Timestamp Counter Value Register -------- */
#define MCAN_TSCV_TSC_Pos                     _UINT32_(0)                                          /* (MCAN_TSCV) Timestamp Counter (cleared on write) Position */
#define MCAN_TSCV_TSC_Msk                     (_UINT32_(0xFFFF) << MCAN_TSCV_TSC_Pos)              /* (MCAN_TSCV) Timestamp Counter (cleared on write) Mask */
#define MCAN_TSCV_TSC(value)                  (MCAN_TSCV_TSC_Msk & (_UINT32_(value) << MCAN_TSCV_TSC_Pos)) /* Assigment of value for TSC in the MCAN_TSCV register */
#define MCAN_TSCV_Msk                         _UINT32_(0x0000FFFF)                                 /* (MCAN_TSCV) Register Mask  */


/* -------- MCAN_TOCC : (MCAN Offset: 0x28) (R/W 32) Timeout Counter Configuration Register -------- */
#define MCAN_TOCC_ETOC_Pos                    _UINT32_(0)                                          /* (MCAN_TOCC) Enable Timeout Counter Position */
#define MCAN_TOCC_ETOC_Msk                    (_UINT32_(0x1) << MCAN_TOCC_ETOC_Pos)                /* (MCAN_TOCC) Enable Timeout Counter Mask */
#define MCAN_TOCC_ETOC(value)                 (MCAN_TOCC_ETOC_Msk & (_UINT32_(value) << MCAN_TOCC_ETOC_Pos)) /* Assigment of value for ETOC in the MCAN_TOCC register */
#define   MCAN_TOCC_ETOC_NO_TIMEOUT_Val       _UINT32_(0x0)                                        /* (MCAN_TOCC) Timeout Counter disabled.  */
#define   MCAN_TOCC_ETOC_TOS_CONTROLLED_Val   _UINT32_(0x1)                                        /* (MCAN_TOCC) Timeout Counter enabled.  */
#define MCAN_TOCC_ETOC_NO_TIMEOUT             (MCAN_TOCC_ETOC_NO_TIMEOUT_Val << MCAN_TOCC_ETOC_Pos) /* (MCAN_TOCC) Timeout Counter disabled. Position  */
#define MCAN_TOCC_ETOC_TOS_CONTROLLED         (MCAN_TOCC_ETOC_TOS_CONTROLLED_Val << MCAN_TOCC_ETOC_Pos) /* (MCAN_TOCC) Timeout Counter enabled. Position  */
#define MCAN_TOCC_TOS_Pos                     _UINT32_(1)                                          /* (MCAN_TOCC) Timeout Select Position */
#define MCAN_TOCC_TOS_Msk                     (_UINT32_(0x3) << MCAN_TOCC_TOS_Pos)                 /* (MCAN_TOCC) Timeout Select Mask */
#define MCAN_TOCC_TOS(value)                  (MCAN_TOCC_TOS_Msk & (_UINT32_(value) << MCAN_TOCC_TOS_Pos)) /* Assigment of value for TOS in the MCAN_TOCC register */
#define   MCAN_TOCC_TOS_CONTINUOUS_Val        _UINT32_(0x0)                                        /* (MCAN_TOCC) Continuous operation  */
#define   MCAN_TOCC_TOS_TX_EV_TIMEOUT_Val     _UINT32_(0x1)                                        /* (MCAN_TOCC) Timeout controlled by Tx Event FIFO  */
#define   MCAN_TOCC_TOS_RX0_EV_TIMEOUT_Val    _UINT32_(0x2)                                        /* (MCAN_TOCC) Timeout controlled by Receive FIFO 0  */
#define   MCAN_TOCC_TOS_RX1_EV_TIMEOUT_Val    _UINT32_(0x3)                                        /* (MCAN_TOCC) Timeout controlled by Receive FIFO 1  */
#define MCAN_TOCC_TOS_CONTINUOUS              (MCAN_TOCC_TOS_CONTINUOUS_Val << MCAN_TOCC_TOS_Pos)  /* (MCAN_TOCC) Continuous operation Position  */
#define MCAN_TOCC_TOS_TX_EV_TIMEOUT           (MCAN_TOCC_TOS_TX_EV_TIMEOUT_Val << MCAN_TOCC_TOS_Pos) /* (MCAN_TOCC) Timeout controlled by Tx Event FIFO Position  */
#define MCAN_TOCC_TOS_RX0_EV_TIMEOUT          (MCAN_TOCC_TOS_RX0_EV_TIMEOUT_Val << MCAN_TOCC_TOS_Pos) /* (MCAN_TOCC) Timeout controlled by Receive FIFO 0 Position  */
#define MCAN_TOCC_TOS_RX1_EV_TIMEOUT          (MCAN_TOCC_TOS_RX1_EV_TIMEOUT_Val << MCAN_TOCC_TOS_Pos) /* (MCAN_TOCC) Timeout controlled by Receive FIFO 1 Position  */
#define MCAN_TOCC_TOP_Pos                     _UINT32_(16)                                         /* (MCAN_TOCC) Timeout Period Position */
#define MCAN_TOCC_TOP_Msk                     (_UINT32_(0xFFFF) << MCAN_TOCC_TOP_Pos)              /* (MCAN_TOCC) Timeout Period Mask */
#define MCAN_TOCC_TOP(value)                  (MCAN_TOCC_TOP_Msk & (_UINT32_(value) << MCAN_TOCC_TOP_Pos)) /* Assigment of value for TOP in the MCAN_TOCC register */
#define MCAN_TOCC_Msk                         _UINT32_(0xFFFF0007)                                 /* (MCAN_TOCC) Register Mask  */


/* -------- MCAN_TOCV : (MCAN Offset: 0x2C) (R/W 32) Timeout Counter Value Register -------- */
#define MCAN_TOCV_TOC_Pos                     _UINT32_(0)                                          /* (MCAN_TOCV) Timeout Counter (cleared on write) Position */
#define MCAN_TOCV_TOC_Msk                     (_UINT32_(0xFFFF) << MCAN_TOCV_TOC_Pos)              /* (MCAN_TOCV) Timeout Counter (cleared on write) Mask */
#define MCAN_TOCV_TOC(value)                  (MCAN_TOCV_TOC_Msk & (_UINT32_(value) << MCAN_TOCV_TOC_Pos)) /* Assigment of value for TOC in the MCAN_TOCV register */
#define MCAN_TOCV_Msk                         _UINT32_(0x0000FFFF)                                 /* (MCAN_TOCV) Register Mask  */


/* -------- MCAN_ECR : (MCAN Offset: 0x40) ( R/ 32) Error Counter Register -------- */
#define MCAN_ECR_TEC_Pos                      _UINT32_(0)                                          /* (MCAN_ECR) Transmit Error Counter Position */
#define MCAN_ECR_TEC_Msk                      (_UINT32_(0xFF) << MCAN_ECR_TEC_Pos)                 /* (MCAN_ECR) Transmit Error Counter Mask */
#define MCAN_ECR_TEC(value)                   (MCAN_ECR_TEC_Msk & (_UINT32_(value) << MCAN_ECR_TEC_Pos)) /* Assigment of value for TEC in the MCAN_ECR register */
#define MCAN_ECR_REC_Pos                      _UINT32_(8)                                          /* (MCAN_ECR) Receive Error Counter Position */
#define MCAN_ECR_REC_Msk                      (_UINT32_(0x7F) << MCAN_ECR_REC_Pos)                 /* (MCAN_ECR) Receive Error Counter Mask */
#define MCAN_ECR_REC(value)                   (MCAN_ECR_REC_Msk & (_UINT32_(value) << MCAN_ECR_REC_Pos)) /* Assigment of value for REC in the MCAN_ECR register */
#define MCAN_ECR_RP_Pos                       _UINT32_(15)                                         /* (MCAN_ECR) Receive Error Passive Position */
#define MCAN_ECR_RP_Msk                       (_UINT32_(0x1) << MCAN_ECR_RP_Pos)                   /* (MCAN_ECR) Receive Error Passive Mask */
#define MCAN_ECR_RP(value)                    (MCAN_ECR_RP_Msk & (_UINT32_(value) << MCAN_ECR_RP_Pos)) /* Assigment of value for RP in the MCAN_ECR register */
#define MCAN_ECR_CEL_Pos                      _UINT32_(16)                                         /* (MCAN_ECR) CAN Error Logging (cleared on read) Position */
#define MCAN_ECR_CEL_Msk                      (_UINT32_(0xFF) << MCAN_ECR_CEL_Pos)                 /* (MCAN_ECR) CAN Error Logging (cleared on read) Mask */
#define MCAN_ECR_CEL(value)                   (MCAN_ECR_CEL_Msk & (_UINT32_(value) << MCAN_ECR_CEL_Pos)) /* Assigment of value for CEL in the MCAN_ECR register */
#define MCAN_ECR_Msk                          _UINT32_(0x00FFFFFF)                                 /* (MCAN_ECR) Register Mask  */


