Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/mcan.h
/* -------- MCAN_IE : (MCAN Offset: 0x54) (R/W 32) Interrupt Enable Register -------- */
#define MCAN_IE_RF0NE_Pos                     _UINT32_(0)                                          /* (MCAN_IE) Receive FIFO 0 New Message Interrupt Enable Position */
#define MCAN_IE_RF0NE_Msk                     (_UINT32_(0x1) << MCAN_IE_RF0NE_Pos)                 /* (MCAN_IE) Receive FIFO 0 New Message Interrupt Enable Mask */
#define MCAN_IE_RF0NE(value)                  (MCAN_IE_RF0NE_Msk & (_UINT32_(value) << MCAN_IE_RF0NE_Pos)) /* Assigment of value for RF0NE in the MCAN_IE register */
#define MCAN_IE_RF0WE_Pos                     _UINT32_(1)                                          /* (MCAN_IE) Receive FIFO 0 Watermark Reached Interrupt Enable Position */
#define MCAN_IE_RF0WE_Msk                     (_UINT32_(0x1) << MCAN_IE_RF0WE_Pos)                 /* (MCAN_IE) Receive FIFO 0 Watermark Reached Interrupt Enable Mask */
#define MCAN_IE_RF0WE(value)                  (MCAN_IE_RF0WE_Msk & (_UINT32_(value) << MCAN_IE_RF0WE_Pos)) /* Assigment of value for RF0WE in the MCAN_IE register */
#define MCAN_IE_RF0FE_Pos                     _UINT32_(2)                                          /* (MCAN_IE) Receive FIFO 0 Full Interrupt Enable Position */
#define MCAN_IE_RF0FE_Msk                     (_UINT32_(0x1) << MCAN_IE_RF0FE_Pos)                 /* (MCAN_IE) Receive FIFO 0 Full Interrupt Enable Mask */
#define MCAN_IE_RF0FE(value)                  (MCAN_IE_RF0FE_Msk & (_UINT32_(value) << MCAN_IE_RF0FE_Pos)) /* Assigment of value for RF0FE in the MCAN_IE register */
#define MCAN_IE_RF0LE_Pos                     _UINT32_(3)                                          /* (MCAN_IE) Receive FIFO 0 Message Lost Interrupt Enable Position */
#define MCAN_IE_RF0LE_Msk                     (_UINT32_(0x1) << MCAN_IE_RF0LE_Pos)                 /* (MCAN_IE) Receive FIFO 0 Message Lost Interrupt Enable Mask */
#define MCAN_IE_RF0LE(value)                  (MCAN_IE_RF0LE_Msk & (_UINT32_(value) << MCAN_IE_RF0LE_Pos)) /* Assigment of value for RF0LE in the MCAN_IE register */
#define MCAN_IE_RF1NE_Pos                     _UINT32_(4)                                          /* (MCAN_IE) Receive FIFO 1 New Message Interrupt Enable Position */
#define MCAN_IE_RF1NE_Msk                     (_UINT32_(0x1) << MCAN_IE_RF1NE_Pos)                 /* (MCAN_IE) Receive FIFO 1 New Message Interrupt Enable Mask */
#define MCAN_IE_RF1NE(value)                  (MCAN_IE_RF1NE_Msk & (_UINT32_(value) << MCAN_IE_RF1NE_Pos)) /* Assigment of value for RF1NE in the MCAN_IE register */
#define MCAN_IE_RF1WE_Pos                     _UINT32_(5)                                          /* (MCAN_IE) Receive FIFO 1 Watermark Reached Interrupt Enable Position */
#define MCAN_IE_RF1WE_Msk                     (_UINT32_(0x1) << MCAN_IE_RF1WE_Pos)                 /* (MCAN_IE) Receive FIFO 1 Watermark Reached Interrupt Enable Mask */
#define MCAN_IE_RF1WE(value)                  (MCAN_IE_RF1WE_Msk & (_UINT32_(value) << MCAN_IE_RF1WE_Pos)) /* Assigment of value for RF1WE in the MCAN_IE register */
#define MCAN_IE_RF1FE_Pos                     _UINT32_(6)                                          /* (MCAN_IE) Receive FIFO 1 Full Interrupt Enable Position */
#define MCAN_IE_RF1FE_Msk                     (_UINT32_(0x1) << MCAN_IE_RF1FE_Pos)                 /* (MCAN_IE) Receive FIFO 1 Full Interrupt Enable Mask */
#define MCAN_IE_RF1FE(value)                  (MCAN_IE_RF1FE_Msk & (_UINT32_(value) << MCAN_IE_RF1FE_Pos)) /* Assigment of value for RF1FE in the MCAN_IE register */
#define MCAN_IE_RF1LE_Pos                     _UINT32_(7)                                          /* (MCAN_IE) Receive FIFO 1 Message Lost Interrupt Enable Position */
#define MCAN_IE_RF1LE_Msk                     (_UINT32_(0x1) << MCAN_IE_RF1LE_Pos)                 /* (MCAN_IE) Receive FIFO 1 Message Lost Interrupt Enable Mask */
#define MCAN_IE_RF1LE(value)                  (MCAN_IE_RF1LE_Msk & (_UINT32_(value) << MCAN_IE_RF1LE_Pos)) /* Assigment of value for RF1LE in the MCAN_IE register */
#define MCAN_IE_HPME_Pos                      _UINT32_(8)                                          /* (MCAN_IE) High Priority Message Interrupt Enable Position */
#define MCAN_IE_HPME_Msk                      (_UINT32_(0x1) << MCAN_IE_HPME_Pos)                  /* (MCAN_IE) High Priority Message Interrupt Enable Mask */
#define MCAN_IE_HPME(value)                   (MCAN_IE_HPME_Msk & (_UINT32_(value) << MCAN_IE_HPME_Pos)) /* Assigment of value for HPME in the MCAN_IE register */
#define MCAN_IE_TCE_Pos                       _UINT32_(9)                                          /* (MCAN_IE) Transmission Completed Interrupt Enable Position */
#define MCAN_IE_TCE_Msk                       (_UINT32_(0x1) << MCAN_IE_TCE_Pos)                   /* (MCAN_IE) Transmission Completed Interrupt Enable Mask */
#define MCAN_IE_TCE(value)                    (MCAN_IE_TCE_Msk & (_UINT32_(value) << MCAN_IE_TCE_Pos)) /* Assigment of value for TCE in the MCAN_IE register */
#define MCAN_IE_TCFE_Pos                      _UINT32_(10)                                         /* (MCAN_IE) Transmission Cancellation Finished Interrupt Enable Position */
#define MCAN_IE_TCFE_Msk                      (_UINT32_(0x1) << MCAN_IE_TCFE_Pos)                  /* (MCAN_IE) Transmission Cancellation Finished Interrupt Enable Mask */
#define MCAN_IE_TCFE(value)                   (MCAN_IE_TCFE_Msk & (_UINT32_(value) << MCAN_IE_TCFE_Pos)) /* Assigment of value for TCFE in the MCAN_IE register */
#define MCAN_IE_TFEE_Pos                      _UINT32_(11)                                         /* (MCAN_IE) Tx FIFO Empty Interrupt Enable Position */
#define MCAN_IE_TFEE_Msk                      (_UINT32_(0x1) << MCAN_IE_TFEE_Pos)                  /* (MCAN_IE) Tx FIFO Empty Interrupt Enable Mask */
#define MCAN_IE_TFEE(value)                   (MCAN_IE_TFEE_Msk & (_UINT32_(value) << MCAN_IE_TFEE_Pos)) /* Assigment of value for TFEE in the MCAN_IE register */
#define MCAN_IE_TEFNE_Pos                     _UINT32_(12)                                         /* (MCAN_IE) Tx Event FIFO New Entry Interrupt Enable Position */
#define MCAN_IE_TEFNE_Msk                     (_UINT32_(0x1) << MCAN_IE_TEFNE_Pos)                 /* (MCAN_IE) Tx Event FIFO New Entry Interrupt Enable Mask */
#define MCAN_IE_TEFNE(value)                  (MCAN_IE_TEFNE_Msk & (_UINT32_(value) << MCAN_IE_TEFNE_Pos)) /* Assigment of value for TEFNE in the MCAN_IE register */
#define MCAN_IE_TEFWE_Pos                     _UINT32_(13)                                         /* (MCAN_IE) Tx Event FIFO Watermark Reached Interrupt Enable Position */
#define MCAN_IE_TEFWE_Msk                     (_UINT32_(0x1) << MCAN_IE_TEFWE_Pos)                 /* (MCAN_IE) Tx Event FIFO Watermark Reached Interrupt Enable Mask */
#define MCAN_IE_TEFWE(value)                  (MCAN_IE_TEFWE_Msk & (_UINT32_(value) << MCAN_IE_TEFWE_Pos)) /* Assigment of value for TEFWE in the MCAN_IE register */
#define MCAN_IE_TEFFE_Pos                     _UINT32_(14)                                         /* (MCAN_IE) Tx Event FIFO Full Interrupt Enable Position */
#define MCAN_IE_TEFFE_Msk                     (_UINT32_(0x1) << MCAN_IE_TEFFE_Pos)                 /* (MCAN_IE) Tx Event FIFO Full Interrupt Enable Mask */
#define MCAN_IE_TEFFE(value)                  (MCAN_IE_TEFFE_Msk & (_UINT32_(value) << MCAN_IE_TEFFE_Pos)) /* Assigment of value for TEFFE in the MCAN_IE register */
#define MCAN_IE_TEFLE_Pos                     _UINT32_(15)                                         /* (MCAN_IE) Tx Event FIFO Event Lost Interrupt Enable Position */
#define MCAN_IE_TEFLE_Msk                     (_UINT32_(0x1) << MCAN_IE_TEFLE_Pos)                 /* (MCAN_IE) Tx Event FIFO Event Lost Interrupt Enable Mask */
#define MCAN_IE_TEFLE(value)                  (MCAN_IE_TEFLE_Msk & (_UINT32_(value) << MCAN_IE_TEFLE_Pos)) /* Assigment of value for TEFLE in the MCAN_IE register */
#define MCAN_IE_TSWE_Pos                      _UINT32_(16)                                         /* (MCAN_IE) Timestamp Wraparound Interrupt Enable Position */
#define MCAN_IE_TSWE_Msk                      (_UINT32_(0x1) << MCAN_IE_TSWE_Pos)                  /* (MCAN_IE) Timestamp Wraparound Interrupt Enable Mask */
#define MCAN_IE_TSWE(value)                   (MCAN_IE_TSWE_Msk & (_UINT32_(value) << MCAN_IE_TSWE_Pos)) /* Assigment of value for TSWE in the MCAN_IE register */
#define MCAN_IE_MRAFE_Pos                     _UINT32_(17)                                         /* (MCAN_IE) Message RAM Access Failure Interrupt Enable Position */
#define MCAN_IE_MRAFE_Msk                     (_UINT32_(0x1) << MCAN_IE_MRAFE_Pos)                 /* (MCAN_IE) Message RAM Access Failure Interrupt Enable Mask */
#define MCAN_IE_MRAFE(value)                  (MCAN_IE_MRAFE_Msk & (_UINT32_(value) << MCAN_IE_MRAFE_Pos)) /* Assigment of value for MRAFE in the MCAN_IE register */
#define MCAN_IE_TOOE_Pos                      _UINT32_(18)                                         /* (MCAN_IE) Timeout Occurred Interrupt Enable Position */
#define MCAN_IE_TOOE_Msk                      (_UINT32_(0x1) << MCAN_IE_TOOE_Pos)                  /* (MCAN_IE) Timeout Occurred Interrupt Enable Mask */
#define MCAN_IE_TOOE(value)                   (MCAN_IE_TOOE_Msk & (_UINT32_(value) << MCAN_IE_TOOE_Pos)) /* Assigment of value for TOOE in the MCAN_IE register */
#define MCAN_IE_DRXE_Pos                      _UINT32_(19)                                         /* (MCAN_IE) Message stored to Dedicated Receive Buffer Interrupt Enable Position */
#define MCAN_IE_DRXE_Msk                      (_UINT32_(0x1) << MCAN_IE_DRXE_Pos)                  /* (MCAN_IE) Message stored to Dedicated Receive Buffer Interrupt Enable Mask */
#define MCAN_IE_DRXE(value)                   (MCAN_IE_DRXE_Msk & (_UINT32_(value) << MCAN_IE_DRXE_Pos)) /* Assigment of value for DRXE in the MCAN_IE register */
#define MCAN_IE_ELOE_Pos                      _UINT32_(22)                                         /* (MCAN_IE) Error Logging Overflow Interrupt Enable Position */
#define MCAN_IE_ELOE_Msk                      (_UINT32_(0x1) << MCAN_IE_ELOE_Pos)                  /* (MCAN_IE) Error Logging Overflow Interrupt Enable Mask */
#define MCAN_IE_ELOE(value)                   (MCAN_IE_ELOE_Msk & (_UINT32_(value) << MCAN_IE_ELOE_Pos)) /* Assigment of value for ELOE in the MCAN_IE register */
#define MCAN_IE_EPE_Pos                       _UINT32_(23)                                         /* (MCAN_IE) Error Passive Interrupt Enable Position */
#define MCAN_IE_EPE_Msk                       (_UINT32_(0x1) << MCAN_IE_EPE_Pos)                   /* (MCAN_IE) Error Passive Interrupt Enable Mask */
#define MCAN_IE_EPE(value)                    (MCAN_IE_EPE_Msk & (_UINT32_(value) << MCAN_IE_EPE_Pos)) /* Assigment of value for EPE in the MCAN_IE register */
#define MCAN_IE_EWE_Pos                       _UINT32_(24)                                         /* (MCAN_IE) Warning Status Interrupt Enable Position */
#define MCAN_IE_EWE_Msk                       (_UINT32_(0x1) << MCAN_IE_EWE_Pos)                   /* (MCAN_IE) Warning Status Interrupt Enable Mask */
#define MCAN_IE_EWE(value)                    (MCAN_IE_EWE_Msk & (_UINT32_(value) << MCAN_IE_EWE_Pos)) /* Assigment of value for EWE in the MCAN_IE register */
#define MCAN_IE_BOE_Pos                       _UINT32_(25)                                         /* (MCAN_IE) Bus_Off Status Interrupt Enable Position */
#define MCAN_IE_BOE_Msk                       (_UINT32_(0x1) << MCAN_IE_BOE_Pos)                   /* (MCAN_IE) Bus_Off Status Interrupt Enable Mask */
#define MCAN_IE_BOE(value)                    (MCAN_IE_BOE_Msk & (_UINT32_(value) << MCAN_IE_BOE_Pos)) /* Assigment of value for BOE in the MCAN_IE register */
#define MCAN_IE_WDIE_Pos                      _UINT32_(26)                                         /* (MCAN_IE) Watchdog Interrupt Enable Position */
#define MCAN_IE_WDIE_Msk                      (_UINT32_(0x1) << MCAN_IE_WDIE_Pos)                  /* (MCAN_IE) Watchdog Interrupt Enable Mask */
#define MCAN_IE_WDIE(value)                   (MCAN_IE_WDIE_Msk & (_UINT32_(value) << MCAN_IE_WDIE_Pos)) /* Assigment of value for WDIE in the MCAN_IE register */
#define MCAN_IE_PEAE_Pos                      _UINT32_(27)                                         /* (MCAN_IE) Protocol Error in Arbitration Phase Enable Position */
#define MCAN_IE_PEAE_Msk                      (_UINT32_(0x1) << MCAN_IE_PEAE_Pos)                  /* (MCAN_IE) Protocol Error in Arbitration Phase Enable Mask */
#define MCAN_IE_PEAE(value)                   (MCAN_IE_PEAE_Msk & (_UINT32_(value) << MCAN_IE_PEAE_Pos)) /* Assigment of value for PEAE in the MCAN_IE register */
#define MCAN_IE_PEDE_Pos                      _UINT32_(28)                                         /* (MCAN_IE) Protocol Error in Data Phase Enable Position */
#define MCAN_IE_PEDE_Msk                      (_UINT32_(0x1) << MCAN_IE_PEDE_Pos)                  /* (MCAN_IE) Protocol Error in Data Phase Enable Mask */
#define MCAN_IE_PEDE(value)                   (MCAN_IE_PEDE_Msk & (_UINT32_(value) << MCAN_IE_PEDE_Pos)) /* Assigment of value for PEDE in the MCAN_IE register */
#define MCAN_IE_ARAE_Pos                      _UINT32_(29)                                         /* (MCAN_IE) Access to Reserved Address Enable Position */
#define MCAN_IE_ARAE_Msk                      (_UINT32_(0x1) << MCAN_IE_ARAE_Pos)                  /* (MCAN_IE) Access to Reserved Address Enable Mask */
#define MCAN_IE_ARAE(value)                   (MCAN_IE_ARAE_Msk & (_UINT32_(value) << MCAN_IE_ARAE_Pos)) /* Assigment of value for ARAE in the MCAN_IE register */
#define MCAN_IE_Msk                           _UINT32_(0x3FCFFFFF)                                 /* (MCAN_IE) Register Mask  */


