Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/mcan.h
#define MCAN_ILE_EINT_Pos                     _UINT32_(0)                                          /* (MCAN_ILE Position) Enable Interrupt Line x */
#define MCAN_ILE_EINT_Msk                     (_UINT32_(0x3) << MCAN_ILE_EINT_Pos)                 /* (MCAN_ILE Mask) EINT */
#define MCAN_ILE_EINT(value)                  (MCAN_ILE_EINT_Msk & (_UINT32_(value) << MCAN_ILE_EINT_Pos)) 

/* -------- MCAN_GFC : (MCAN Offset: 0x80) (R/W 32) Global Filter Configuration Register -------- */
#define MCAN_GFC_RRFE_Pos                     _UINT32_(0)                                          /* (MCAN_GFC) Reject Remote Frames Extended Position */
#define MCAN_GFC_RRFE_Msk                     (_UINT32_(0x1) << MCAN_GFC_RRFE_Pos)                 /* (MCAN_GFC) Reject Remote Frames Extended Mask */
#define MCAN_GFC_RRFE(value)                  (MCAN_GFC_RRFE_Msk & (_UINT32_(value) << MCAN_GFC_RRFE_Pos)) /* Assigment of value for RRFE in the MCAN_GFC register */
#define   MCAN_GFC_RRFE_FILTER_Val            _UINT32_(0x0)                                        /* (MCAN_GFC) Filter remote frames with 29-bit extended IDs.  */
#define   MCAN_GFC_RRFE_REJECT_Val            _UINT32_(0x1)                                        /* (MCAN_GFC) Reject all remote frames with 29-bit extended IDs.  */
#define MCAN_GFC_RRFE_FILTER                  (MCAN_GFC_RRFE_FILTER_Val << MCAN_GFC_RRFE_Pos)      /* (MCAN_GFC) Filter remote frames with 29-bit extended IDs. Position  */
#define MCAN_GFC_RRFE_REJECT                  (MCAN_GFC_RRFE_REJECT_Val << MCAN_GFC_RRFE_Pos)      /* (MCAN_GFC) Reject all remote frames with 29-bit extended IDs. Position  */
#define MCAN_GFC_RRFS_Pos                     _UINT32_(1)                                          /* (MCAN_GFC) Reject Remote Frames Standard Position */
#define MCAN_GFC_RRFS_Msk                     (_UINT32_(0x1) << MCAN_GFC_RRFS_Pos)                 /* (MCAN_GFC) Reject Remote Frames Standard Mask */
#define MCAN_GFC_RRFS(value)                  (MCAN_GFC_RRFS_Msk & (_UINT32_(value) << MCAN_GFC_RRFS_Pos)) /* Assigment of value for RRFS in the MCAN_GFC register */
#define   MCAN_GFC_RRFS_FILTER_Val            _UINT32_(0x0)                                        /* (MCAN_GFC) Filter remote frames with 11-bit standard IDs.  */
#define   MCAN_GFC_RRFS_REJECT_Val            _UINT32_(0x1)                                        /* (MCAN_GFC) Reject all remote frames with 11-bit standard IDs.  */
#define MCAN_GFC_RRFS_FILTER                  (MCAN_GFC_RRFS_FILTER_Val << MCAN_GFC_RRFS_Pos)      /* (MCAN_GFC) Filter remote frames with 11-bit standard IDs. Position  */
#define MCAN_GFC_RRFS_REJECT                  (MCAN_GFC_RRFS_REJECT_Val << MCAN_GFC_RRFS_Pos)      /* (MCAN_GFC) Reject all remote frames with 11-bit standard IDs. Position  */
#define MCAN_GFC_ANFE_Pos                     _UINT32_(2)                                          /* (MCAN_GFC) Accept Non-matching Frames Extended Position */
#define MCAN_GFC_ANFE_Msk                     (_UINT32_(0x3) << MCAN_GFC_ANFE_Pos)                 /* (MCAN_GFC) Accept Non-matching Frames Extended Mask */
#define MCAN_GFC_ANFE(value)                  (MCAN_GFC_ANFE_Msk & (_UINT32_(value) << MCAN_GFC_ANFE_Pos)) /* Assigment of value for ANFE in the MCAN_GFC register */
#define   MCAN_GFC_ANFE_RX_FIFO_0_Val         _UINT32_(0x0)                                        /* (MCAN_GFC) Accept in Rx FIFO 0  */
#define   MCAN_GFC_ANFE_RX_FIFO_1_Val         _UINT32_(0x1)                                        /* (MCAN_GFC) Accept in Rx FIFO 1  */
#define MCAN_GFC_ANFE_RX_FIFO_0               (MCAN_GFC_ANFE_RX_FIFO_0_Val << MCAN_GFC_ANFE_Pos)   /* (MCAN_GFC) Accept in Rx FIFO 0 Position  */
#define MCAN_GFC_ANFE_RX_FIFO_1               (MCAN_GFC_ANFE_RX_FIFO_1_Val << MCAN_GFC_ANFE_Pos)   /* (MCAN_GFC) Accept in Rx FIFO 1 Position  */
#define MCAN_GFC_ANFS_Pos                     _UINT32_(4)                                          /* (MCAN_GFC) Accept Non-matching Frames Standard Position */
#define MCAN_GFC_ANFS_Msk                     (_UINT32_(0x3) << MCAN_GFC_ANFS_Pos)                 /* (MCAN_GFC) Accept Non-matching Frames Standard Mask */
#define MCAN_GFC_ANFS(value)                  (MCAN_GFC_ANFS_Msk & (_UINT32_(value) << MCAN_GFC_ANFS_Pos)) /* Assigment of value for ANFS in the MCAN_GFC register */
#define   MCAN_GFC_ANFS_RX_FIFO_0_Val         _UINT32_(0x0)                                        /* (MCAN_GFC) Accept in Rx FIFO 0  */
#define   MCAN_GFC_ANFS_RX_FIFO_1_Val         _UINT32_(0x1)                                        /* (MCAN_GFC) Accept in Rx FIFO 1  */
#define MCAN_GFC_ANFS_RX_FIFO_0               (MCAN_GFC_ANFS_RX_FIFO_0_Val << MCAN_GFC_ANFS_Pos)   /* (MCAN_GFC) Accept in Rx FIFO 0 Position  */
#define MCAN_GFC_ANFS_RX_FIFO_1               (MCAN_GFC_ANFS_RX_FIFO_1_Val << MCAN_GFC_ANFS_Pos)   /* (MCAN_GFC) Accept in Rx FIFO 1 Position  */
#define MCAN_GFC_Msk                          _UINT32_(0x0000003F)                                 /* (MCAN_GFC) Register Mask  */


/* -------- MCAN_SIDFC : (MCAN Offset: 0x84) (R/W 32) Standard ID Filter Configuration Register -------- */
#define MCAN_SIDFC_FLSSA_Pos                  _UINT32_(2)                                          /* (MCAN_SIDFC) Filter List Standard Start Address Position */
#define MCAN_SIDFC_FLSSA_Msk                  (_UINT32_(0x3FFF) << MCAN_SIDFC_FLSSA_Pos)           /* (MCAN_SIDFC) Filter List Standard Start Address Mask */
#define MCAN_SIDFC_FLSSA(value)               (MCAN_SIDFC_FLSSA_Msk & (_UINT32_(value) << MCAN_SIDFC_FLSSA_Pos)) /* Assigment of value for FLSSA in the MCAN_SIDFC register */
#define MCAN_SIDFC_LSS_Pos                    _UINT32_(16)                                         /* (MCAN_SIDFC) List Size Standard Position */
#define MCAN_SIDFC_LSS_Msk                    (_UINT32_(0xFF) << MCAN_SIDFC_LSS_Pos)               /* (MCAN_SIDFC) List Size Standard Mask */
#define MCAN_SIDFC_LSS(value)                 (MCAN_SIDFC_LSS_Msk & (_UINT32_(value) << MCAN_SIDFC_LSS_Pos)) /* Assigment of value for LSS in the MCAN_SIDFC register */
#define MCAN_SIDFC_Msk                        _UINT32_(0x00FFFFFC)                                 /* (MCAN_SIDFC) Register Mask  */


/* -------- MCAN_XIDFC : (MCAN Offset: 0x88) (R/W 32) Extended ID Filter Configuration Register -------- */
#define MCAN_XIDFC_FLESA_Pos                  _UINT32_(2)                                          /* (MCAN_XIDFC) Filter List Extended Start Address Position */
#define MCAN_XIDFC_FLESA_Msk                  (_UINT32_(0x3FFF) << MCAN_XIDFC_FLESA_Pos)           /* (MCAN_XIDFC) Filter List Extended Start Address Mask */
#define MCAN_XIDFC_FLESA(value)               (MCAN_XIDFC_FLESA_Msk & (_UINT32_(value) << MCAN_XIDFC_FLESA_Pos)) /* Assigment of value for FLESA in the MCAN_XIDFC register */
#define MCAN_XIDFC_LSE_Pos                    _UINT32_(16)                                         /* (MCAN_XIDFC) List Size Extended Position */
#define MCAN_XIDFC_LSE_Msk                    (_UINT32_(0x7F) << MCAN_XIDFC_LSE_Pos)               /* (MCAN_XIDFC) List Size Extended Mask */
#define MCAN_XIDFC_LSE(value)                 (MCAN_XIDFC_LSE_Msk & (_UINT32_(value) << MCAN_XIDFC_LSE_Pos)) /* Assigment of value for LSE in the MCAN_XIDFC register */
#define MCAN_XIDFC_Msk                        _UINT32_(0x007FFFFC)                                 /* (MCAN_XIDFC) Register Mask  */


/* -------- MCAN_XIDAM : (MCAN Offset: 0x90) (R/W 32) Extended ID AND Mask Register -------- */
#define MCAN_XIDAM_EIDM_Pos                   _UINT32_(0)                                          /* (MCAN_XIDAM) Extended ID Mask Position */
#define MCAN_XIDAM_EIDM_Msk                   (_UINT32_(0x1FFFFFFF) << MCAN_XIDAM_EIDM_Pos)        /* (MCAN_XIDAM) Extended ID Mask Mask */
#define MCAN_XIDAM_EIDM(value)                (MCAN_XIDAM_EIDM_Msk & (_UINT32_(value) << MCAN_XIDAM_EIDM_Pos)) /* Assigment of value for EIDM in the MCAN_XIDAM register */
#define MCAN_XIDAM_Msk                        _UINT32_(0x1FFFFFFF)                                 /* (MCAN_XIDAM) Register Mask  */


/* -------- MCAN_HPMS : (MCAN Offset: 0x94) ( R/ 32) High Priority Message Status Register -------- */
#define MCAN_HPMS_BIDX_Pos                    _UINT32_(0)                                          /* (MCAN_HPMS) Buffer Index Position */
#define MCAN_HPMS_BIDX_Msk                    (_UINT32_(0x3F) << MCAN_HPMS_BIDX_Pos)               /* (MCAN_HPMS) Buffer Index Mask */
#define MCAN_HPMS_BIDX(value)                 (MCAN_HPMS_BIDX_Msk & (_UINT32_(value) << MCAN_HPMS_BIDX_Pos)) /* Assigment of value for BIDX in the MCAN_HPMS register */
#define MCAN_HPMS_MSI_Pos                     _UINT32_(6)                                          /* (MCAN_HPMS) Message Storage Indicator Position */
#define MCAN_HPMS_MSI_Msk                     (_UINT32_(0x3) << MCAN_HPMS_MSI_Pos)                 /* (MCAN_HPMS) Message Storage Indicator Mask */
#define MCAN_HPMS_MSI(value)                  (MCAN_HPMS_MSI_Msk & (_UINT32_(value) << MCAN_HPMS_MSI_Pos)) /* Assigment of value for MSI in the MCAN_HPMS register */
#define   MCAN_HPMS_MSI_NO_FIFO_SEL_Val       _UINT32_(0x0)                                        /* (MCAN_HPMS) No FIFO selected.  */
#define   MCAN_HPMS_MSI_LOST_Val              _UINT32_(0x1)                                        /* (MCAN_HPMS) FIFO message lost.  */
#define   MCAN_HPMS_MSI_FIFO_0_Val            _UINT32_(0x2)                                        /* (MCAN_HPMS) Message stored in FIFO 0.  */
#define   MCAN_HPMS_MSI_FIFO_1_Val            _UINT32_(0x3)                                        /* (MCAN_HPMS) Message stored in FIFO 1.  */
#define MCAN_HPMS_MSI_NO_FIFO_SEL             (MCAN_HPMS_MSI_NO_FIFO_SEL_Val << MCAN_HPMS_MSI_Pos) /* (MCAN_HPMS) No FIFO selected. Position  */
#define MCAN_HPMS_MSI_LOST                    (MCAN_HPMS_MSI_LOST_Val << MCAN_HPMS_MSI_Pos)        /* (MCAN_HPMS) FIFO message lost. Position  */
#define MCAN_HPMS_MSI_FIFO_0                  (MCAN_HPMS_MSI_FIFO_0_Val << MCAN_HPMS_MSI_Pos)      /* (MCAN_HPMS) Message stored in FIFO 0. Position  */
#define MCAN_HPMS_MSI_FIFO_1                  (MCAN_HPMS_MSI_FIFO_1_Val << MCAN_HPMS_MSI_Pos)      /* (MCAN_HPMS) Message stored in FIFO 1. Position  */
#define MCAN_HPMS_FIDX_Pos                    _UINT32_(8)                                          /* (MCAN_HPMS) Filter Index Position */
#define MCAN_HPMS_FIDX_Msk                    (_UINT32_(0x7F) << MCAN_HPMS_FIDX_Pos)               /* (MCAN_HPMS) Filter Index Mask */
#define MCAN_HPMS_FIDX(value)                 (MCAN_HPMS_FIDX_Msk & (_UINT32_(value) << MCAN_HPMS_FIDX_Pos)) /* Assigment of value for FIDX in the MCAN_HPMS register */
#define MCAN_HPMS_FLST_Pos                    _UINT32_(15)                                         /* (MCAN_HPMS) Filter List Position */
#define MCAN_HPMS_FLST_Msk                    (_UINT32_(0x1) << MCAN_HPMS_FLST_Pos)                /* (MCAN_HPMS) Filter List Mask */
#define MCAN_HPMS_FLST(value)                 (MCAN_HPMS_FLST_Msk & (_UINT32_(value) << MCAN_HPMS_FLST_Pos)) /* Assigment of value for FLST in the MCAN_HPMS register */
#define MCAN_HPMS_Msk                         _UINT32_(0x0000FFFF)                                 /* (MCAN_HPMS) Register Mask  */


