Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/mcan.h
/* -------- MCAN_NDAT2 : (MCAN Offset: 0x9C) (R/W 32) New Data 2 Register -------- */
#define MCAN_NDAT2_ND32_Pos                   _UINT32_(0)                                          /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND32_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND32_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND32(value)                (MCAN_NDAT2_ND32_Msk & (_UINT32_(value) << MCAN_NDAT2_ND32_Pos)) /* Assigment of value for ND32 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND33_Pos                   _UINT32_(1)                                          /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND33_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND33_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND33(value)                (MCAN_NDAT2_ND33_Msk & (_UINT32_(value) << MCAN_NDAT2_ND33_Pos)) /* Assigment of value for ND33 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND34_Pos                   _UINT32_(2)                                          /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND34_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND34_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND34(value)                (MCAN_NDAT2_ND34_Msk & (_UINT32_(value) << MCAN_NDAT2_ND34_Pos)) /* Assigment of value for ND34 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND35_Pos                   _UINT32_(3)                                          /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND35_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND35_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND35(value)                (MCAN_NDAT2_ND35_Msk & (_UINT32_(value) << MCAN_NDAT2_ND35_Pos)) /* Assigment of value for ND35 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND36_Pos                   _UINT32_(4)                                          /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND36_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND36_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND36(value)                (MCAN_NDAT2_ND36_Msk & (_UINT32_(value) << MCAN_NDAT2_ND36_Pos)) /* Assigment of value for ND36 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND37_Pos                   _UINT32_(5)                                          /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND37_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND37_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND37(value)                (MCAN_NDAT2_ND37_Msk & (_UINT32_(value) << MCAN_NDAT2_ND37_Pos)) /* Assigment of value for ND37 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND38_Pos                   _UINT32_(6)                                          /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND38_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND38_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND38(value)                (MCAN_NDAT2_ND38_Msk & (_UINT32_(value) << MCAN_NDAT2_ND38_Pos)) /* Assigment of value for ND38 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND39_Pos                   _UINT32_(7)                                          /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND39_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND39_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND39(value)                (MCAN_NDAT2_ND39_Msk & (_UINT32_(value) << MCAN_NDAT2_ND39_Pos)) /* Assigment of value for ND39 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND40_Pos                   _UINT32_(8)                                          /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND40_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND40_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND40(value)                (MCAN_NDAT2_ND40_Msk & (_UINT32_(value) << MCAN_NDAT2_ND40_Pos)) /* Assigment of value for ND40 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND41_Pos                   _UINT32_(9)                                          /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND41_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND41_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND41(value)                (MCAN_NDAT2_ND41_Msk & (_UINT32_(value) << MCAN_NDAT2_ND41_Pos)) /* Assigment of value for ND41 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND42_Pos                   _UINT32_(10)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND42_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND42_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND42(value)                (MCAN_NDAT2_ND42_Msk & (_UINT32_(value) << MCAN_NDAT2_ND42_Pos)) /* Assigment of value for ND42 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND43_Pos                   _UINT32_(11)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND43_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND43_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND43(value)                (MCAN_NDAT2_ND43_Msk & (_UINT32_(value) << MCAN_NDAT2_ND43_Pos)) /* Assigment of value for ND43 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND44_Pos                   _UINT32_(12)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND44_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND44_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND44(value)                (MCAN_NDAT2_ND44_Msk & (_UINT32_(value) << MCAN_NDAT2_ND44_Pos)) /* Assigment of value for ND44 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND45_Pos                   _UINT32_(13)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND45_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND45_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND45(value)                (MCAN_NDAT2_ND45_Msk & (_UINT32_(value) << MCAN_NDAT2_ND45_Pos)) /* Assigment of value for ND45 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND46_Pos                   _UINT32_(14)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND46_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND46_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND46(value)                (MCAN_NDAT2_ND46_Msk & (_UINT32_(value) << MCAN_NDAT2_ND46_Pos)) /* Assigment of value for ND46 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND47_Pos                   _UINT32_(15)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND47_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND47_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND47(value)                (MCAN_NDAT2_ND47_Msk & (_UINT32_(value) << MCAN_NDAT2_ND47_Pos)) /* Assigment of value for ND47 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND48_Pos                   _UINT32_(16)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND48_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND48_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND48(value)                (MCAN_NDAT2_ND48_Msk & (_UINT32_(value) << MCAN_NDAT2_ND48_Pos)) /* Assigment of value for ND48 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND49_Pos                   _UINT32_(17)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND49_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND49_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND49(value)                (MCAN_NDAT2_ND49_Msk & (_UINT32_(value) << MCAN_NDAT2_ND49_Pos)) /* Assigment of value for ND49 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND50_Pos                   _UINT32_(18)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND50_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND50_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND50(value)                (MCAN_NDAT2_ND50_Msk & (_UINT32_(value) << MCAN_NDAT2_ND50_Pos)) /* Assigment of value for ND50 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND51_Pos                   _UINT32_(19)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND51_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND51_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND51(value)                (MCAN_NDAT2_ND51_Msk & (_UINT32_(value) << MCAN_NDAT2_ND51_Pos)) /* Assigment of value for ND51 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND52_Pos                   _UINT32_(20)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND52_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND52_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND52(value)                (MCAN_NDAT2_ND52_Msk & (_UINT32_(value) << MCAN_NDAT2_ND52_Pos)) /* Assigment of value for ND52 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND53_Pos                   _UINT32_(21)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND53_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND53_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND53(value)                (MCAN_NDAT2_ND53_Msk & (_UINT32_(value) << MCAN_NDAT2_ND53_Pos)) /* Assigment of value for ND53 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND54_Pos                   _UINT32_(22)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND54_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND54_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND54(value)                (MCAN_NDAT2_ND54_Msk & (_UINT32_(value) << MCAN_NDAT2_ND54_Pos)) /* Assigment of value for ND54 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND55_Pos                   _UINT32_(23)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND55_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND55_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND55(value)                (MCAN_NDAT2_ND55_Msk & (_UINT32_(value) << MCAN_NDAT2_ND55_Pos)) /* Assigment of value for ND55 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND56_Pos                   _UINT32_(24)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND56_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND56_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND56(value)                (MCAN_NDAT2_ND56_Msk & (_UINT32_(value) << MCAN_NDAT2_ND56_Pos)) /* Assigment of value for ND56 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND57_Pos                   _UINT32_(25)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND57_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND57_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND57(value)                (MCAN_NDAT2_ND57_Msk & (_UINT32_(value) << MCAN_NDAT2_ND57_Pos)) /* Assigment of value for ND57 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND58_Pos                   _UINT32_(26)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND58_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND58_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND58(value)                (MCAN_NDAT2_ND58_Msk & (_UINT32_(value) << MCAN_NDAT2_ND58_Pos)) /* Assigment of value for ND58 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND59_Pos                   _UINT32_(27)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND59_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND59_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND59(value)                (MCAN_NDAT2_ND59_Msk & (_UINT32_(value) << MCAN_NDAT2_ND59_Pos)) /* Assigment of value for ND59 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND60_Pos                   _UINT32_(28)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND60_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND60_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND60(value)                (MCAN_NDAT2_ND60_Msk & (_UINT32_(value) << MCAN_NDAT2_ND60_Pos)) /* Assigment of value for ND60 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND61_Pos                   _UINT32_(29)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND61_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND61_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND61(value)                (MCAN_NDAT2_ND61_Msk & (_UINT32_(value) << MCAN_NDAT2_ND61_Pos)) /* Assigment of value for ND61 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND62_Pos                   _UINT32_(30)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND62_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND62_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND62(value)                (MCAN_NDAT2_ND62_Msk & (_UINT32_(value) << MCAN_NDAT2_ND62_Pos)) /* Assigment of value for ND62 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_ND63_Pos                   _UINT32_(31)                                         /* (MCAN_NDAT2) New Data Position */
#define MCAN_NDAT2_ND63_Msk                   (_UINT32_(0x1) << MCAN_NDAT2_ND63_Pos)               /* (MCAN_NDAT2) New Data Mask */
#define MCAN_NDAT2_ND63(value)                (MCAN_NDAT2_ND63_Msk & (_UINT32_(value) << MCAN_NDAT2_ND63_Pos)) /* Assigment of value for ND63 in the MCAN_NDAT2 register */
#define MCAN_NDAT2_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (MCAN_NDAT2) Register Mask  */

#define MCAN_NDAT2_ND_Pos                     _UINT32_(0)                                          /* (MCAN_NDAT2 Position) New Data */
#define MCAN_NDAT2_ND_Msk                     (_UINT32_(0xFFFFFFFF) << MCAN_NDAT2_ND_Pos)          /* (MCAN_NDAT2 Mask) ND */
#define MCAN_NDAT2_ND(value)                  (MCAN_NDAT2_ND_Msk & (_UINT32_(value) << MCAN_NDAT2_ND_Pos)) 

/* -------- MCAN_RXF0C : (MCAN Offset: 0xA0) (R/W 32) Receive FIFO 0 Configuration Register -------- */
#define MCAN_RXF0C_F0SA_Pos                   _UINT32_(2)                                          /* (MCAN_RXF0C) Receive FIFO 0 Start Address Position */
#define MCAN_RXF0C_F0SA_Msk                   (_UINT32_(0x3FFF) << MCAN_RXF0C_F0SA_Pos)            /* (MCAN_RXF0C) Receive FIFO 0 Start Address Mask */
#define MCAN_RXF0C_F0SA(value)                (MCAN_RXF0C_F0SA_Msk & (_UINT32_(value) << MCAN_RXF0C_F0SA_Pos)) /* Assigment of value for F0SA in the MCAN_RXF0C register */
#define MCAN_RXF0C_F0S_Pos                    _UINT32_(16)                                         /* (MCAN_RXF0C) Receive FIFO 0 Size Position */
#define MCAN_RXF0C_F0S_Msk                    (_UINT32_(0x7F) << MCAN_RXF0C_F0S_Pos)               /* (MCAN_RXF0C) Receive FIFO 0 Size Mask */
#define MCAN_RXF0C_F0S(value)                 (MCAN_RXF0C_F0S_Msk & (_UINT32_(value) << MCAN_RXF0C_F0S_Pos)) /* Assigment of value for F0S in the MCAN_RXF0C register */
#define MCAN_RXF0C_F0WM_Pos                   _UINT32_(24)                                         /* (MCAN_RXF0C) Receive FIFO 0 Watermark Position */
#define MCAN_RXF0C_F0WM_Msk                   (_UINT32_(0x7F) << MCAN_RXF0C_F0WM_Pos)              /* (MCAN_RXF0C) Receive FIFO 0 Watermark Mask */
#define MCAN_RXF0C_F0WM(value)                (MCAN_RXF0C_F0WM_Msk & (_UINT32_(value) << MCAN_RXF0C_F0WM_Pos)) /* Assigment of value for F0WM in the MCAN_RXF0C register */
#define MCAN_RXF0C_F0OM_Pos                   _UINT32_(31)                                         /* (MCAN_RXF0C) FIFO 0 Operation Mode Position */
#define MCAN_RXF0C_F0OM_Msk                   (_UINT32_(0x1) << MCAN_RXF0C_F0OM_Pos)               /* (MCAN_RXF0C) FIFO 0 Operation Mode Mask */
#define MCAN_RXF0C_F0OM(value)                (MCAN_RXF0C_F0OM_Msk & (_UINT32_(value) << MCAN_RXF0C_F0OM_Pos)) /* Assigment of value for F0OM in the MCAN_RXF0C register */
#define MCAN_RXF0C_Msk                        _UINT32_(0xFF7FFFFC)                                 /* (MCAN_RXF0C) Register Mask  */


