Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/mcan.h
#define MCAN_TXBCF_CF_Pos                     _UINT32_(0)                                          /* (MCAN_TXBCF Position) Cancellation Finished for Transmit Buffer 3x */
#define MCAN_TXBCF_CF_Msk                     (_UINT32_(0xFFFFFFFF) << MCAN_TXBCF_CF_Pos)          /* (MCAN_TXBCF Mask) CF */
#define MCAN_TXBCF_CF(value)                  (MCAN_TXBCF_CF_Msk & (_UINT32_(value) << MCAN_TXBCF_CF_Pos)) 

/* -------- MCAN_TXBTIE : (MCAN Offset: 0xE0) (R/W 32) Transmit Buffer Transmission Interrupt Enable Register -------- */
#define MCAN_TXBTIE_TIE0_Pos                  _UINT32_(0)                                          /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 0 Position */
#define MCAN_TXBTIE_TIE0_Msk                  (_UINT32_(0x1) << MCAN_TXBTIE_TIE0_Pos)              /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 0 Mask */
#define MCAN_TXBTIE_TIE0(value)               (MCAN_TXBTIE_TIE0_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE0_Pos)) /* Assigment of value for TIE0 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE1_Pos                  _UINT32_(1)                                          /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 1 Position */
#define MCAN_TXBTIE_TIE1_Msk                  (_UINT32_(0x1) << MCAN_TXBTIE_TIE1_Pos)              /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 1 Mask */
#define MCAN_TXBTIE_TIE1(value)               (MCAN_TXBTIE_TIE1_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE1_Pos)) /* Assigment of value for TIE1 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE2_Pos                  _UINT32_(2)                                          /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 2 Position */
#define MCAN_TXBTIE_TIE2_Msk                  (_UINT32_(0x1) << MCAN_TXBTIE_TIE2_Pos)              /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 2 Mask */
#define MCAN_TXBTIE_TIE2(value)               (MCAN_TXBTIE_TIE2_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE2_Pos)) /* Assigment of value for TIE2 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE3_Pos                  _UINT32_(3)                                          /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 3 Position */
#define MCAN_TXBTIE_TIE3_Msk                  (_UINT32_(0x1) << MCAN_TXBTIE_TIE3_Pos)              /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 3 Mask */
#define MCAN_TXBTIE_TIE3(value)               (MCAN_TXBTIE_TIE3_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE3_Pos)) /* Assigment of value for TIE3 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE4_Pos                  _UINT32_(4)                                          /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 4 Position */
#define MCAN_TXBTIE_TIE4_Msk                  (_UINT32_(0x1) << MCAN_TXBTIE_TIE4_Pos)              /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 4 Mask */
#define MCAN_TXBTIE_TIE4(value)               (MCAN_TXBTIE_TIE4_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE4_Pos)) /* Assigment of value for TIE4 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE5_Pos                  _UINT32_(5)                                          /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 5 Position */
#define MCAN_TXBTIE_TIE5_Msk                  (_UINT32_(0x1) << MCAN_TXBTIE_TIE5_Pos)              /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 5 Mask */
#define MCAN_TXBTIE_TIE5(value)               (MCAN_TXBTIE_TIE5_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE5_Pos)) /* Assigment of value for TIE5 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE6_Pos                  _UINT32_(6)                                          /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 6 Position */
#define MCAN_TXBTIE_TIE6_Msk                  (_UINT32_(0x1) << MCAN_TXBTIE_TIE6_Pos)              /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 6 Mask */
#define MCAN_TXBTIE_TIE6(value)               (MCAN_TXBTIE_TIE6_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE6_Pos)) /* Assigment of value for TIE6 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE7_Pos                  _UINT32_(7)                                          /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 7 Position */
#define MCAN_TXBTIE_TIE7_Msk                  (_UINT32_(0x1) << MCAN_TXBTIE_TIE7_Pos)              /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 7 Mask */
#define MCAN_TXBTIE_TIE7(value)               (MCAN_TXBTIE_TIE7_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE7_Pos)) /* Assigment of value for TIE7 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE8_Pos                  _UINT32_(8)                                          /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 8 Position */
#define MCAN_TXBTIE_TIE8_Msk                  (_UINT32_(0x1) << MCAN_TXBTIE_TIE8_Pos)              /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 8 Mask */
#define MCAN_TXBTIE_TIE8(value)               (MCAN_TXBTIE_TIE8_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE8_Pos)) /* Assigment of value for TIE8 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE9_Pos                  _UINT32_(9)                                          /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 9 Position */
#define MCAN_TXBTIE_TIE9_Msk                  (_UINT32_(0x1) << MCAN_TXBTIE_TIE9_Pos)              /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 9 Mask */
#define MCAN_TXBTIE_TIE9(value)               (MCAN_TXBTIE_TIE9_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE9_Pos)) /* Assigment of value for TIE9 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE10_Pos                 _UINT32_(10)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 10 Position */
#define MCAN_TXBTIE_TIE10_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE10_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 10 Mask */
#define MCAN_TXBTIE_TIE10(value)              (MCAN_TXBTIE_TIE10_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE10_Pos)) /* Assigment of value for TIE10 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE11_Pos                 _UINT32_(11)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 11 Position */
#define MCAN_TXBTIE_TIE11_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE11_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 11 Mask */
#define MCAN_TXBTIE_TIE11(value)              (MCAN_TXBTIE_TIE11_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE11_Pos)) /* Assigment of value for TIE11 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE12_Pos                 _UINT32_(12)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 12 Position */
#define MCAN_TXBTIE_TIE12_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE12_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 12 Mask */
#define MCAN_TXBTIE_TIE12(value)              (MCAN_TXBTIE_TIE12_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE12_Pos)) /* Assigment of value for TIE12 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE13_Pos                 _UINT32_(13)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 13 Position */
#define MCAN_TXBTIE_TIE13_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE13_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 13 Mask */
#define MCAN_TXBTIE_TIE13(value)              (MCAN_TXBTIE_TIE13_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE13_Pos)) /* Assigment of value for TIE13 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE14_Pos                 _UINT32_(14)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 14 Position */
#define MCAN_TXBTIE_TIE14_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE14_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 14 Mask */
#define MCAN_TXBTIE_TIE14(value)              (MCAN_TXBTIE_TIE14_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE14_Pos)) /* Assigment of value for TIE14 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE15_Pos                 _UINT32_(15)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 15 Position */
#define MCAN_TXBTIE_TIE15_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE15_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 15 Mask */
#define MCAN_TXBTIE_TIE15(value)              (MCAN_TXBTIE_TIE15_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE15_Pos)) /* Assigment of value for TIE15 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE16_Pos                 _UINT32_(16)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 16 Position */
#define MCAN_TXBTIE_TIE16_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE16_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 16 Mask */
#define MCAN_TXBTIE_TIE16(value)              (MCAN_TXBTIE_TIE16_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE16_Pos)) /* Assigment of value for TIE16 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE17_Pos                 _UINT32_(17)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 17 Position */
#define MCAN_TXBTIE_TIE17_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE17_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 17 Mask */
#define MCAN_TXBTIE_TIE17(value)              (MCAN_TXBTIE_TIE17_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE17_Pos)) /* Assigment of value for TIE17 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE18_Pos                 _UINT32_(18)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 18 Position */
#define MCAN_TXBTIE_TIE18_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE18_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 18 Mask */
#define MCAN_TXBTIE_TIE18(value)              (MCAN_TXBTIE_TIE18_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE18_Pos)) /* Assigment of value for TIE18 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE19_Pos                 _UINT32_(19)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 19 Position */
#define MCAN_TXBTIE_TIE19_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE19_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 19 Mask */
#define MCAN_TXBTIE_TIE19(value)              (MCAN_TXBTIE_TIE19_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE19_Pos)) /* Assigment of value for TIE19 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE20_Pos                 _UINT32_(20)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 20 Position */
#define MCAN_TXBTIE_TIE20_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE20_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 20 Mask */
#define MCAN_TXBTIE_TIE20(value)              (MCAN_TXBTIE_TIE20_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE20_Pos)) /* Assigment of value for TIE20 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE21_Pos                 _UINT32_(21)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 21 Position */
#define MCAN_TXBTIE_TIE21_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE21_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 21 Mask */
#define MCAN_TXBTIE_TIE21(value)              (MCAN_TXBTIE_TIE21_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE21_Pos)) /* Assigment of value for TIE21 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE22_Pos                 _UINT32_(22)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 22 Position */
#define MCAN_TXBTIE_TIE22_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE22_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 22 Mask */
#define MCAN_TXBTIE_TIE22(value)              (MCAN_TXBTIE_TIE22_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE22_Pos)) /* Assigment of value for TIE22 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE23_Pos                 _UINT32_(23)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 23 Position */
#define MCAN_TXBTIE_TIE23_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE23_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 23 Mask */
#define MCAN_TXBTIE_TIE23(value)              (MCAN_TXBTIE_TIE23_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE23_Pos)) /* Assigment of value for TIE23 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE24_Pos                 _UINT32_(24)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 24 Position */
#define MCAN_TXBTIE_TIE24_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE24_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 24 Mask */
#define MCAN_TXBTIE_TIE24(value)              (MCAN_TXBTIE_TIE24_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE24_Pos)) /* Assigment of value for TIE24 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE25_Pos                 _UINT32_(25)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 25 Position */
#define MCAN_TXBTIE_TIE25_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE25_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 25 Mask */
#define MCAN_TXBTIE_TIE25(value)              (MCAN_TXBTIE_TIE25_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE25_Pos)) /* Assigment of value for TIE25 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE26_Pos                 _UINT32_(26)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 26 Position */
#define MCAN_TXBTIE_TIE26_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE26_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 26 Mask */
#define MCAN_TXBTIE_TIE26(value)              (MCAN_TXBTIE_TIE26_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE26_Pos)) /* Assigment of value for TIE26 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE27_Pos                 _UINT32_(27)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 27 Position */
#define MCAN_TXBTIE_TIE27_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE27_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 27 Mask */
#define MCAN_TXBTIE_TIE27(value)              (MCAN_TXBTIE_TIE27_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE27_Pos)) /* Assigment of value for TIE27 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE28_Pos                 _UINT32_(28)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 28 Position */
#define MCAN_TXBTIE_TIE28_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE28_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 28 Mask */
#define MCAN_TXBTIE_TIE28(value)              (MCAN_TXBTIE_TIE28_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE28_Pos)) /* Assigment of value for TIE28 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE29_Pos                 _UINT32_(29)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 29 Position */
#define MCAN_TXBTIE_TIE29_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE29_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 29 Mask */
#define MCAN_TXBTIE_TIE29(value)              (MCAN_TXBTIE_TIE29_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE29_Pos)) /* Assigment of value for TIE29 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE30_Pos                 _UINT32_(30)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 30 Position */
#define MCAN_TXBTIE_TIE30_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE30_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 30 Mask */
#define MCAN_TXBTIE_TIE30(value)              (MCAN_TXBTIE_TIE30_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE30_Pos)) /* Assigment of value for TIE30 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_TIE31_Pos                 _UINT32_(31)                                         /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 31 Position */
#define MCAN_TXBTIE_TIE31_Msk                 (_UINT32_(0x1) << MCAN_TXBTIE_TIE31_Pos)             /* (MCAN_TXBTIE) Transmission Interrupt Enable for Buffer 31 Mask */
#define MCAN_TXBTIE_TIE31(value)              (MCAN_TXBTIE_TIE31_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE31_Pos)) /* Assigment of value for TIE31 in the MCAN_TXBTIE register */
#define MCAN_TXBTIE_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (MCAN_TXBTIE) Register Mask  */

#define MCAN_TXBTIE_TIE_Pos                   _UINT32_(0)                                          /* (MCAN_TXBTIE Position) Transmission Interrupt Enable for Buffer 3x */
#define MCAN_TXBTIE_TIE_Msk                   (_UINT32_(0xFFFFFFFF) << MCAN_TXBTIE_TIE_Pos)        /* (MCAN_TXBTIE Mask) TIE */
#define MCAN_TXBTIE_TIE(value)                (MCAN_TXBTIE_TIE_Msk & (_UINT32_(value) << MCAN_TXBTIE_TIE_Pos)) 

